app/views/projects/index.html.erb

<%= @projects.collect { |item| {:id => item.id, :todos => item.todos}}.to_json%>
---
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 1]]